Sandy6Zhou/nRF54L15_v3.2.1_P6402/nrf/applications/P6402_BLE/ext_module/imu/vendor/bmi3_defs.h
/*! To define warnings for FIFO activity */
#define BMI3_W_FIFO_EMPTY                            UINT8_C(1)
#define BMI3_W_PARTIAL_READ                          UINT8_C(2)
#define BMI3_W_ST_PARTIAL_READ                       UINT8_C(3)
#define BMI3_W_FIFO_GYRO_DUMMY_FRAME                 UINT8_C(4)
#define BMI3_W_FIFO_ACCEL_DUMMY_FRAME                UINT8_C(5)
#define BMI3_W_FIFO_TEMP_DUMMY_FRAME                 UINT8_C(6)
#define BMI3_W_FIFO_INVALID_FRAME                    UINT8_C(7)

/*! Masks for FIFO dummy data frames */
#define BMI3_FIFO_GYRO_DUMMY_FRAME                   UINT16_C(0x7f02)
#define BMI3_FIFO_ACCEL_DUMMY_FRAME                  UINT16_C(0x7f01)
#define BMI3_FIFO_TEMP_DUMMY_FRAME                   UINT16_C(0x8000)

/*! Bit wise to define information */
#define BMI3_I_MIN_VALUE                             UINT8_C(1)
#define BMI3_I_MAX_VALUE                             UINT8_C(2)

/*! To define Self-test enable modes */
#define BMI3_ST_ACCEL_ONLY                           UINT8_C(1)
#define BMI3_ST_GYRO_ONLY                            UINT8_C(2)
#define BMI3_ST_BOTH_ACC_GYR                         UINT8_C(3)

/*! Soft-reset delay */
#define BMI3_SOFT_RESET_DELAY                        UINT16_C(1500)

/*! Macro to define read data(0x03 to 0x0F) length */
#define BMI3_READ_REG_DATA_LEN                       UINT8_C(26)

/***************************************************************************** */
/*!         Sensor Macro Definitions                 */
/***************************************************************************** */
/*! Macros to define BMI3 sensor/feature types */
#define BMI3_ACCEL                                   UINT8_C(0)
#define BMI3_GYRO                                    UINT8_C(1)
#define BMI3_SIG_MOTION                              UINT8_C(2)
#define BMI3_ANY_MOTION                              UINT8_C(3)
#define BMI3_NO_MOTION                               UINT8_C(4)
#define BMI3_STEP_COUNTER                            UINT8_C(5)
#define BMI3_TILT                                    UINT8_C(6)
#define BMI3_ORIENTATION                             UINT8_C(7)
#define BMI3_FLAT                                    UINT8_C(8)
#define BMI3_TAP                                     UINT8_C(9)
#define BMI3_ALT_ACCEL                               UINT8_C(10)
#define BMI3_ALT_GYRO                                UINT8_C(11)
#define BMI3_ALT_AUTO_CONFIG                         UINT8_C(12)

/*! Non virtual sensor features */
#define BMI3_TEMP                                    UINT8_C(13)
#define BMI3_I3C_SYNC_ACCEL                          UINT8_C(14)
#define BMI3_I3C_SYNC_GYRO                           UINT8_C(15)
#define BMI3_I3C_SYNC_TEMP                           UINT8_C(16)

#define BMI3_16_BIT_RESOLUTION                       UINT8_C(16)

/*! Masks for mapping of config major and minor mask instances in the system */
#define BMI3_CONFIG_1_MAJOR_MASK                     UINT16_C(0xFC00)
#define BMI3_CONFIG_1_MINOR_MASK                     UINT16_C(0x03FF)
#define BMI3_CONFIG_2_MAJOR_MASK                     UINT16_C(0xFC00)
#define BMI3_CONFIG_2_MINOR_MASK                     UINT16_C(0x03FF)

/*! Bit position for config version */
#define BMI3_CONFIG_POS                              UINT8_C(10)

/*! BMI3 I2C address */
#define BMI3_ADDR_I2C_PRIM                           UINT8_C(0x68)
#define BMI3_ADDR_I2C_SEC                            UINT8_C(0x69)

/********************************************************* */
/*!                 Register Addresses                    */
/********************************************************* */

/*! To define the chip id address */
#define BMI3_REG_CHIP_ID                             UINT8_C(0x00)

/*! Reports sensor error conditions */
#define BMI3_REG_ERR_REG                             UINT8_C(0x01)

/*! Sensor status flags */
#define BMI3_REG_STATUS                              UINT8_C(0x02)

/*! ACC Data X. */
#define BMI3_REG_ACC_DATA_X                          UINT8_C(0x03)

/*! ACC Data Y. */
#define BMI3_REG_ACC_DATA_Y                          UINT8_C(0x04)

/*! ACC Data Z. */
#define BMI3_REG_ACC_DATA_Z                          UINT8_C(0x05)

/*! GYR Data X. */
#define BMI3_REG_GYR_DATA_X                          UINT8_C(0x06)

/*! GYR Data Y. */
#define BMI3_REG_GYR_DATA_Y                          UINT8_C(0x07)

/*! GYR Data Z. */
#define BMI3_REG_GYR_DATA_Z                          UINT8_C(0x08)

/*! Temperature Data.
 *  The resolution is 512 LSB/K.
 *  0x0000 -> 23 degree Celsius
 *  0x8000 -> invalid
 */
#define BMI3_REG_TEMP_DATA                           UINT8_C(0x09)

/*! Sensor time LSW (15:0). */
#define BMI3_REG_SENSOR_TIME_0                       UINT8_C(0x0A)

/*! Sensor time MSW (31:16). */
#define BMI3_REG_SENSOR_TIME_1                       UINT8_C(0x0B)

/*! Saturation flags for each sensor and axis. */
#define BMI3_REG_SAT_FLAGS                           UINT8_C(0x0C)

/*! INT1 Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_INT1                     UINT8_C(0x0D)

/*! INT2 Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_INT2                     UINT8_C(0x0E)

/*! I3C IBI Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_IBI                      UINT8_C(0x0F)

/*! Feature engine configuration, before setting/changing an active configuration the register must be cleared
(set to 0) */
#define BMI3_REG_FEATURE_IO0                         UINT8_C(0x10)

/*! Feature engine I/O register 0. */
#define BMI3_REG_FEATURE_IO1                         UINT8_C(0x11)

/*! Feature engine I/O register 1. */
#define BMI3_REG_FEATURE_IO2                         UINT8_C(0x12)

/*! Feature engine I/O register 2. */
#define BMI3_REG_FEATURE_IO3                         UINT8_C(0x13)

/*! Feature I/O synchronization status and trigger. */
#define BMI3_REG_FEATURE_IO_STATUS                   UINT8_C(0x14)

