Sandy6Zhou/nRF54L15_v3.2.1_P6402/nrf/applications/P6402_BLE/ext_module/imu/vendor/bmi3_defs.h
#define BMI3_TAP_DETECTOR_T_TAP_EN_MASK              UINT16_C(0x4000)
#define BMI3_TAP_DETECTOR_T_TAP_EN_POS               UINT8_C(14)

#define BMI3_I3C_SYNC_FILTER_EN_MASK                 UINT16_C(0x0001)

#define BMI3_I3C_SYNC_EN_MASK                        UINT16_C(0x8000)
#define BMI3_I3C_SYNC_EN_POS                         UINT8_C(15)

/*! Error and status information */
#define BMI3_ERROR_STATUS_MASK                       UINT16_C(0x000F)

#define BMI3_FEAT_ENG_INACT_MASK                     UINT8_C(0x0)

#define BMI3_FEAT_ENG_ACT_MASK                       UINT8_C(0x1)

#define BMI3_INIT_CRC_ERR_MASK                       UINT8_C(0x3)

#define BMI3_UGAIN_OFFS_UPD_ERR_MASK                 UINT8_C(0x4)

#define BMI3_NO_ERROR_MASK                           UINT8_C(0x5)

#define BMI3_AXIS_MAP_ERR_MASK                       UINT8_C(0x6)

#define BMI3_TCSYNC_CONF_ERR_MASK                    UINT8_C(0x8)

#define BMI3_SC_ST_ABORTED_MASK                      UINT8_C(0x9)

#define BMI3_SC_IGNORED_MASK                         UINT8_C(0xA)

#define BMI3_ST_IGNORED_MASK                         UINT8_C(0xB)

#define BMI3_SC_ST_PRECON_ERR_MASK                   UINT8_C(0xC)

#define BMI3_MODE_CHANGE_WHILE_SC_ST_MASK            UINT8_C(0xD)

#define BMI3_POSTPONE_I3C_SYNC_MASK                  UINT8_C(0xE)

#define BMI3_MODE_CHANGE_WHILE_I3C_SYNC_MASK         UINT8_C(0xF)

/*! Self-calibration (gyroscope only) or self-test (accelerometer and/or gyroscope) execution status. 0 indicates that
 * the procedure is ongoing. 1 indicates that the procedure is completed. */
#define BMI3_SC_ST_COMPLETE_MASK                     UINT16_C(0x0010)
#define BMI3_SC_ST_COMPLETE_POS                      UINT8_C(4)

/*! Gyroscope self-calibration result (1=OK, 0=Not OK). Bit sc_st_complete should be 1 prior to reading this bit. */
#define BMI3_GYRO_SC_RESULT_MASK                     UINT16_C(0x0020)
#define BMI3_GYRO_SC_RESULT_POS                      UINT8_C(5)

/*! Accelerometer and/or gyroscope self-test result (1=OK, 0=Not OK). Bit sc_st_complete should be 1 prior to reading
 * this bit. */
#define BMI3_ST_RESULT_MASK                          UINT16_C(0x0040)
#define BMI3_ST_RESULT_POS                           UINT8_C(6)

/*! Insufficient sample rate for either 50Hz or 200Hz or I3C TC-sync feature */
#define BMI3_SAMPLE_RATE_ERR_MASK                    UINT16_C(0x0080)
#define BMI3_SAMPLE_RATE_ERR_POS                     UINT8_C(7)

/*! User gain/offset update execution status. 0 indicates that the procedure is ongoing. 1 indicates that the procedure
 * is completed */
#define BMI3_UGAIN_OFFS_UPD_COMPLETE_MASK            UINT16_C(0x0100)
#define BMI3_UGAIN_OFFS_UPD_COMPLETE_POS             UINT8_C(8)

/*! Axis mapping completed */
#define BMI3_AXIS_MAP_COMPLETE_MASK                  UINT16_C(0x0400)
#define BMI3_AXIS_MAP_COMPLETE_POS                   UINT8_C(10)

/*! Current state of the system */
#define BMI3_STATE_MASK                              UINT16_C(0x1800)
#define BMI3_STATE_POS                               UINT8_C(11)

/*! Before feature engine enable: Feature engine start-up configuration */
#define BMI3_STARTUP_CONFIG_0_MASK                   UINT16_C(0x0FFFF)

/*! Step counter value word-0 (low word) */
#define BMI3_STEP_COUNTER_OUT_0_MASK                 UINT16_C(0x0FFFF)

/*! Before feature engine enable: Feature engine start-up configuration */
#define BMI3_STARTUP_CONFIG_1_MASK                   UINT16_C(0x0FFFF)

/*! Step counter value word-1 (high word) */
#define BMI3_STEP_COUNTER_OUT_1_MASK                 UINT16_C(0x0FFFF)

/*! On read: data has been written by the feature engine On write: data written by the host shall be sent to the feature
 * engine. */
#define BMI3_FEATURE_IO_STATUS_MASK                  UINT16_C(0x0001)

/*! Current fill level of FIFO buffer
 * An empty FIFO corresponds to 0x000. The word counter may be reset by reading out all frames from the FIFO buffer or
 * when the FIFO is reset through fifo_flush. The word counter is updated each time a complete frame was read or
 * written. */
#define BMI3_FIFO_FILL_LEVEL_MASK                    UINT16_C(0x07FF)

/*! FIFO read data (16 bits)
 * Data format depends on the setting of register FIFO_CONF. The FIFO data are organized in frames. The new data flag is
 * preserved. Read burst access must be used, the address will not increment when the read burst reads at the address of
 * FIFO_DATA. When a frame is only partially read out it is retransmitted including the header at the next readout. */
#define BMI3_FIFO_DATA_MASK                          UINT16_C(0x0FFFF)

/*! ODR in Hz */
#define BMI3_ACC_ODR_MASK                            UINT16_C(0x000F)

/*! Full scale, Resolution */
#define BMI3_ACC_RANGE_MASK                          UINT16_C(0x0070)
#define BMI3_ACC_RANGE_POS                           UINT8_C(4)

/*! The Accel bandwidth coefficient defines the 3 dB cutoff frequency in relation to the ODR */
#define BMI3_ACC_BW_MASK                             UINT16_C(0x0080)
#define BMI3_ACC_BW_POS                              UINT8_C(7)

/*! Number of samples to be averaged */
#define BMI3_ACC_AVG_NUM_MASK                        UINT16_C(0x0700)
#define BMI3_ACC_AVG_NUM_POS                         UINT8_C(8)

/*! Defines mode of operation for Accelerometer. DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ACC_MODE_MASK                           UINT16_C(0x7000)
#define BMI3_ACC_MODE_POS                            UINT8_C(12)

/*! ODR in Hz */
#define BMI3_GYR_ODR_MASK                            UINT16_C(0x000F)

/*! Full scale, Resolution */
#define BMI3_GYR_RANGE_MASK                          UINT16_C(0x0070)
#define BMI3_GYR_RANGE_POS                           UINT8_C(4)

/*! The Gyroscope bandwidth coefficient defines the 3 dB cutoff frequency in relation to the ODR */
#define BMI3_GYR_BW_MASK                             UINT16_C(0x0080)
#define BMI3_GYR_BW_POS                              UINT8_C(7)

/*! Number of samples to be averaged */
#define BMI3_GYR_AVG_NUM_MASK                        UINT16_C(0x0700)
#define BMI3_GYR_AVG_NUM_POS                         UINT8_C(8)

/*! Defines mode of operation for Gyroscope.DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_GYR_MODE_MASK                           UINT16_C(0x7000)
#define BMI3_GYR_MODE_POS                            UINT8_C(12)

