Sandy6Zhou/nRF54L15_v3.2.1_P6402/nrf/applications/P6402_BLE/ext_module/imu/vendor/bmi3_defs.h
/*! Gyroscope DPS Range */
#define BMI3_GYR_RANGE_125DPS                        UINT8_C(0x00)
#define BMI3_GYR_RANGE_250DPS                        UINT8_C(0x01)
#define BMI3_GYR_RANGE_500DPS                        UINT8_C(0x02)
#define BMI3_GYR_RANGE_1000DPS                       UINT8_C(0x03)
#define BMI3_GYR_RANGE_2000DPS                       UINT8_C(0x04)

/*! Gyroscope mode */
#define BMI3_GYR_MODE_DISABLE                        UINT8_C(0x00)
#define BMI3_GYR_MODE_SUSPEND                        UINT8_C(0X01)
#define BMI3_GYR_MODE_LOW_PWR                        UINT8_C(0x03)
#define BMI3_GYR_MODE_NORMAL                         UINT8_C(0X04)
#define BMI3_GYR_MODE_HIGH_PERF                      UINT8_C(0x07)

/*! Gyroscope bandwidth */
#define BMI3_GYR_BW_ODR_HALF                         UINT8_C(0)
#define BMI3_GYR_BW_ODR_QUARTER                      UINT8_C(1)

/******************************************************************************/
/*!        Alternate Accelerometer Macro Definitions               */
/******************************************************************************/
/*!  Alternate Accelerometer Bandwidth parameters */
#define BMI3_ALT_ACC_AVG1                            UINT8_C(0x00)
#define BMI3_ALT_ACC_AVG2                            UINT8_C(0x01)
#define BMI3_ALT_ACC_AVG4                            UINT8_C(0x02)
#define BMI3_ALT_ACC_AVG8                            UINT8_C(0x03)
#define BMI3_ALT_ACC_AVG16                           UINT8_C(0x04)
#define BMI3_ALT_ACC_AVG32                           UINT8_C(0x05)
#define BMI3_ALT_ACC_AVG64                           UINT8_C(0x06)

/*! Alternate Accelerometer Output Data Rate */
#define BMI3_ALT_ACC_ODR_0_78HZ                      UINT8_C(0x01)
#define BMI3_ALT_ACC_ODR_1_56HZ                      UINT8_C(0x02)
#define BMI3_ALT_ACC_ODR_3_125HZ                     UINT8_C(0x03)
#define BMI3_ALT_ACC_ODR_6_25HZ                      UINT8_C(0x04)
#define BMI3_ALT_ACC_ODR_12_5HZ                      UINT8_C(0x05)
#define BMI3_ALT_ACC_ODR_25HZ                        UINT8_C(0x06)
#define BMI3_ALT_ACC_ODR_50HZ                        UINT8_C(0x07)
#define BMI3_ALT_ACC_ODR_100HZ                       UINT8_C(0x08)
#define BMI3_ALT_ACC_ODR_200HZ                       UINT8_C(0x09)
#define BMI3_ALT_ACC_ODR_400HZ                       UINT8_C(0x0A)
#define BMI3_ALT_ACC_ODR_800HZ                       UINT8_C(0x0B)
#define BMI3_ALT_ACC_ODR_1600HZ                      UINT8_C(0x0C)
#define BMI3_ALT_ACC_ODR_3200HZ                      UINT8_C(0x0D)
#define BMI3_ALT_ACC_ODR_6400HZ                      UINT8_C(0x0E)

/*! Alternate Accelerometer mode */
#define BMI3_ALT_ACC_MODE_DISABLE                    UINT8_C(0x00)
#define BMI3_ALT_ACC_MODE_LOW_PWR                    UINT8_C(0x03)
#define BMI3_ALT_ACC_MODE_NORMAL                     UINT8_C(0X04)
#define BMI3_ALT_ACC_MODE_HIGH_PERF                  UINT8_C(0x07)

/******************************************************************************/
/*!      Alternate Gyroscope Macro Definitions               */
/******************************************************************************/
/*!  Alternate Gyroscope Bandwidth parameters */
#define BMI3_ALT_GYR_AVG1                            UINT8_C(0x00)
#define BMI3_ALT_GYR_AVG2                            UINT8_C(0x01)
#define BMI3_ALT_GYR_AVG4                            UINT8_C(0x02)
#define BMI3_ALT_GYR_AVG8                            UINT8_C(0x03)
#define BMI3_ALT_GYR_AVG16                           UINT8_C(0x04)
#define BMI3_ALT_GYR_AVG32                           UINT8_C(0x05)
#define BMI3_ALT_GYR_AVG64                           UINT8_C(0x06)

/*! Alternate Gyroscope Output Data Rate */
#define BMI3_ALT_GYR_ODR_0_78HZ                      UINT8_C(0x01)
#define BMI3_ALT_GYR_ODR_1_56HZ                      UINT8_C(0x02)
#define BMI3_ALT_GYR_ODR_3_125HZ                     UINT8_C(0x03)
#define BMI3_ALT_GYR_ODR_6_25HZ                      UINT8_C(0x04)
#define BMI3_ALT_GYR_ODR_12_5HZ                      UINT8_C(0x05)
#define BMI3_ALT_GYR_ODR_25HZ                        UINT8_C(0x06)
#define BMI3_ALT_GYR_ODR_50HZ                        UINT8_C(0x07)
#define BMI3_ALT_GYR_ODR_100HZ                       UINT8_C(0x08)
#define BMI3_ALT_GYR_ODR_200HZ                       UINT8_C(0x09)
#define BMI3_ALT_GYR_ODR_400HZ                       UINT8_C(0x0A)
#define BMI3_ALT_GYR_ODR_800HZ                       UINT8_C(0x0B)
#define BMI3_ALT_GYR_ODR_1600HZ                      UINT8_C(0x0C)
#define BMI3_ALT_GYR_ODR_3200HZ                      UINT8_C(0x0D)
#define BMI3_ALT_GYR_ODR_6400HZ                      UINT8_C(0x0E)

/*! Alternate Gyroscope mode */
#define BMI3_ALT_GYR_MODE_DISABLE                    UINT8_C(0x00)
#define BMI3_ALT_GYR_MODE_SUSPEND                    UINT8_C(0X01)
#define BMI3_ALT_GYR_MODE_LOW_PWR                    UINT8_C(0x03)
#define BMI3_ALT_GYR_MODE_NORMAL                     UINT8_C(0X04)
#define BMI3_ALT_GYR_MODE_HIGH_PERF                  UINT8_C(0x07)

/******************************************************************************/
/*!       I3C Macro Definitions               */
/******************************************************************************/

/*! I3C sync ODR */
#define BMI3_I3C_SYNC_ODR_6_25HZ                     UINT8_C(0x04)
#define BMI3_I3C_SYNC_ODR_12_5HZ                     UINT8_C(0x05)
#define BMI3_I3C_SYNC_ODR_25HZ                       UINT8_C(0x06)
#define BMI3_I3C_SYNC_ODR_50HZ                       UINT8_C(0x07)
#define BMI3_I3C_SYNC_ODR_100HZ                      UINT8_C(0x08)
#define BMI3_I3C_SYNC_ODR_200HZ                      UINT8_C(0x09)
#define BMI3_I3C_SYNC_ODR_400HZ                      UINT8_C(0x0A)
#define BMI3_I3C_SYNC_ODR_800HZ                      UINT8_C(0x0B)

/*! I3C sync division factor */
#define BMI3_I3C_SYNC_DIVISION_FACTOR_11             UINT8_C(0)
#define BMI3_I3C_SYNC_DIVISION_FACTOR_12             UINT8_C(1)
#define BMI3_I3C_SYNC_DIVISION_FACTOR_13             UINT8_C(2)
#define BMI3_I3C_SYNC_DIVISION_FACTOR_14             UINT8_C(3)

/******************************************************************************/
/*!       Feature interrupts base address definitions               */
/******************************************************************************/

#define BMI3_BASE_ADDR_CONFIG_VERSION                UINT8_C(0x00)
#define BMI3_BASE_ADDR_AXIS_REMAP                    UINT8_C(0x03)
#define BMI3_BASE_ADDR_ANY_MOTION                    UINT8_C(0x05)
#define BMI3_BASE_ADDR_NO_MOTION                     UINT8_C(0x08)
#define BMI3_BASE_ADDR_FLAT                          UINT8_C(0x0B)
#define BMI3_BASE_ADDR_SIG_MOTION                    UINT8_C(0x0D)
#define BMI3_BASE_ADDR_STEP_CNT                      UINT8_C(0x10)
#define BMI3_BASE_ADDR_ORIENT                        UINT8_C(0x1C)
#define BMI3_BASE_ADDR_TAP                           UINT8_C(0x1E)
#define BMI3_BASE_ADDR_TILT                          UINT8_C(0x21)
#define BMI3_BASE_ADDR_ALT_AUTO_CONFIG               UINT8_C(0X23)
#define BMI3_BASE_ADDR_ST_RESULT                     UINT8_C(0x24)
#define BMI3_BASE_ADDR_ST_SELECT                     UINT8_C(0x25)
#define BMI3_BASE_ADDR_GYRO_SC_SELECT                UINT8_C(0x26)
#define BMI3_BASE_ADDR_GYRO_SC_ST_CONF               UINT8_C(0x27)
#define BMI3_BASE_ADDR_GYRO_SC_ST_COEFFICIENTS       UINT8_C(0x28)
#define BMI3_BASE_ADDR_I3C_SYNC                      UINT8_C(0x36)
#define BMI3_BASE_ADDR_I3C_SYNC_ACC                  UINT8_C(0x37)
#define BMI3_BASE_ADDR_I3C_SYNC_GYR                  UINT8_C(0x3A)
#define BMI3_BASE_ADDR_I3C_SYNC_TEMP                 UINT8_C(0x3D)
#define BMI3_BASE_ADDR_I3C_SYNC_TIME                 UINT8_C(0x3E)
#define BMI3_BASE_ADDR_ACC_GYR_OFFSET_GAIN_RESET     UINT8_C(0x3F)
#define BMI3_BASE_ADDR_ACC_OFFSET_GAIN               UINT8_C(0x40)
#define BMI3_BASE_ADDR_GYRO_OFFSET_GAIN              UINT8_C(0x46)

/******************************************************************************/
/*! @name BMI3 Interrupt Modes */
/******************************************************************************/
/*! Non latched */
#define BMI3_INT_NON_LATCH                           UINT8_C(0)

