Sandy6Zhou/nRF54L15_v3.2.1_P6402/nrf/applications/P6402_BLE/ext_module/imu/vendor/bmi3_defs.h
#define BMI3_INT_LATCH_EN                            UINT8_C(1)
#define BMI3_INT_LATCH_DISABLE                       UINT8_C(0)

/*! BMI3 Interrupt Pin Behavior */
#define BMI3_INT_PUSH_PULL                           UINT8_C(0)
#define BMI3_INT_OPEN_DRAIN                          UINT8_C(1)

/*! BMI3 Interrupt Pin Level */
#define BMI3_INT_ACTIVE_LOW                          UINT8_C(0)
#define BMI3_INT_ACTIVE_HIGH                         UINT8_C(1)

/*! BMI3 Interrupt Output Enable */
#define BMI3_INT_OUTPUT_DISABLE                      UINT8_C(0)
#define BMI3_INT_OUTPUT_ENABLE                       UINT8_C(1)

/*! Orientation output macros */
#define BMI3_FACE_UP                                 UINT8_C(0x00)
#define BMI3_FACE_DOWN                               UINT8_C(0x01)

#define BMI3_PORTRAIT_UP_RIGHT                       UINT8_C(0x00)
#define BMI3_LANDSCAPE_LEFT                          UINT8_C(0x01)
#define BMI3_PORTRAIT_UP_DOWN                        UINT8_C(0x02)
#define BMI3_LANDSCAPE_RIGHT                         UINT8_C(0x03)

/******************************************************************************/
/*! @name       FIFO Macro Definitions                                        */
/******************************************************************************/

/*! Mask definitions for FIFO frame content configuration */
#define BMI3_FIFO_STOP_ON_FULL                       UINT16_C(0x0001)
#define BMI3_FIFO_TIME_EN                            UINT16_C(0x0100)
#define BMI3_FIFO_ACC_EN                             UINT16_C(0x0200)
#define BMI3_FIFO_GYR_EN                             UINT16_C(0x0400)
#define BMI3_FIFO_TEMP_EN                            UINT16_C(0x0800)
#define BMI3_FIFO_ALL_EN                             UINT16_C(0x0F00)

/*! FIFO sensor data lengths */
#define BMI3_LENGTH_FIFO_ACC                         UINT8_C(6)
#define BMI3_LENGTH_FIFO_GYR                         UINT8_C(6)
#define BMI3_LENGTH_TEMPERATURE                      UINT8_C(2)
#define BMI3_LENGTH_SENSOR_TIME                      UINT8_C(2)
#define BMI3_LENGTH_FIFO_CONFIG                      UINT8_C(2)
#define BMI3_LENGTH_FIFO_WM                          UINT8_C(2)
#define BMI3_LENGTH_MAX_FIFO_FILTER                  UINT8_C(1)
#define BMI3_LENGTH_FIFO_DATA                        UINT8_C(2)
#define BMI3_LENGTH_FIFO_MSB_BYTE                    UINT8_C(1)

/*! BMI3 Mask definitions of FIFO configuration registers */
#define BMI3_FIFO_CONFIG_MASK                        UINT16_C(0x0F01)

/*! BMI3 sensor selection for header-less frames  */
#define BMI3_FIFO_HEAD_LESS_ACC_FRM                  UINT16_C(0x0200)
#define BMI3_FIFO_HEAD_LESS_GYR_FRM                  UINT16_C(0x0400)
#define BMI3_FIFO_HEAD_LESS_SENS_TIME_FRM            UINT16_C(0x0100)
#define BMI3_FIFO_HEAD_LESS_TEMP_FRM                 UINT16_C(0x0800)
#define BMI3_FIFO_HEAD_LESS_ALL_FRM                  UINT16_C(0x0F00)

/******************************************************************************/
/*! @name       CFG RES Macro Definitions                                     */
/******************************************************************************/

#define BMI3_CFG_RES_VALUE_ONE                       UINT8_C(0x07)
#define BMI3_CFG_RES_MASK                            UINT8_C(0x80)

/******************************************************************************/
/*! @name       Alternate configuration macros                                */
/******************************************************************************/

/*! Enables switching possibility to alternate configuration for accel */
#define BMI3_ALT_ACC_ENABLE                          UINT8_C(0x01)

/*! Enables switching possibility to alternate configuration for gyro */
#define BMI3_ALT_GYR_ENABLE                          UINT8_C(0x10)

#define BMI3_ALT_CONF_ALT_SWITCH_MASK                UINT8_C(0x0F)

#define BMI3_ALT_CONF_USER_SWITCH_MASK               UINT8_C(0xF0)
#define BMI3_ALT_CONF_USER_SWITCH_POS                UINT8_C(4)

#define BMI3_ALT_CONF_RESET_ON                       UINT8_C(1)
#define BMI3_ALT_CONF_RESET_OFF                      UINT8_C(0)

#define BMI3_ALT_NO_MOTION                           UINT8_C(1)
#define BMI3_ALT_ANY_MOTION                          UINT8_C(2)
#define BMI3_ALT_FLAT                                UINT8_C(3)
#define BMI3_ALT_ORIENT                              UINT8_C(4)
#define BMI3_ALT_STEP_DETECTOR                       UINT8_C(5)
#define BMI3_ALT_STEP_COUNTER                        UINT8_C(6)
#define BMI3_ALT_SIG_MOTION                          UINT8_C(7)
#define BMI3_ALT_TILT                                UINT8_C(8)
#define BMI3_ALT_TAP                                 UINT8_C(9)

#define BMI3_ALT_ACCEL_STATUS_MASK                   UINT8_C(0x01)

#define BMI3_ALT_GYRO_STATUS_MASK                    UINT8_C(0x10)
#define BMI3_ALT_GYRO_STATUS_POS                     UINT8_C(4)

/******************************************************************************/
/*! @name       Status macros                                                 */
/******************************************************************************/
#define BMI3_STATUS_POR                              UINT8_C(0x01)
#define BMI3_STATUS_DRDY_TEMP                        UINT8_C(0x20)
#define BMI3_STATUS_DRDY_GYR                         UINT8_C(0x40)
#define BMI3_STATUS_DRDY_ACC                         UINT8_C(0x80)

/******************************************************************************/
/*! @name       FOC macros                                                    */
/******************************************************************************/

/* Reference value with positive and negative noise range in lsb */

/*
 * As per datasheet, Zero-g offset : +/- 50mg
 *
 * In range 2G,  1G is 16384. so, 16384 x 50 x (10 ^ -3) = 819
 * In range 4G,  1G is 8192.  so,  8192 x 50 x (10 ^ -3) = 410
 * In range 8G,  1G is 4096.  so,  4096 x 50 x (10 ^ -3) = 205
 * In range 16G, 1G is 2048.  so,  2048 x 50 x (10 ^ -3) = 102
 */
#define BMI3_ACC_FOC_2G_REF           UINT16_C(16384)
#define BMI3_ACC_FOC_4G_REF           UINT16_C(8192)
#define BMI3_ACC_FOC_8G_REF           UINT16_C(4096)
#define BMI3_ACC_FOC_16G_REF          UINT16_C(2048)

